nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/WolfSSLDemo/src/smc_gen/r_ether_rx/src/r_ether_rx.c
/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 ***********************************************************************************************************************/
#include <string.h>

/* Access to peripherals and board defines. */
#include "platform.h"

#include "r_ether_rx_if.h"
#include "src/r_ether_rx_private.h"

/***********************************************************************************************************************
 Macro definitions
 ***********************************************************************************************************************/

/***********************************************************************************************************************
 Typedef definitions
 ***********************************************************************************************************************/

/***********************************************************************************************************************
 Exported global variables (to be accessed by other files)
 ***********************************************************************************************************************/

/***********************************************************************************************************************
 Private global variables and functions
 ***********************************************************************************************************************/
#if (ETHER_CFG_NON_BLOCKING == 1)
static uint16_t local_advertise[ETHER_CHANNEL_MAX]; /* the capabilities of the local link as PHY data */
static uint16_t g_local_pause_bits[ETHER_CHANNEL_MAX];
static pmgi_param_t g_phy_current_param[PMGI_CHANNEL_MAX];
#endif

static uint8_t padding_insert_position[ETHER_CHANNEL_MAX];
static uint8_t padding_insert_size[ETHER_CHANNEL_MAX];

/*
 * Private global function prototypes
 */
static void ether_reset_mac (uint32_t channel);
static void ether_init_descriptors (uint32_t channel);
static void ether_config_ethernet (uint32_t channel, const uint8_t mode);
static void ether_pause_resolution (uint16_t local_ability, uint16_t partner_ability, uint16_t * ptx_pause,
        uint16_t * prx_pause);
static void ether_configure_mac (uint32_t channel, const uint8_t mac_addr[], const uint8_t mode);
#if (ETHER_CFG_NON_BLOCKING == 0)
static ether_return_t ether_do_link (uint32_t channel, const uint8_t mode);
#endif
static ether_return_t ether_set_callback (ether_param_t const control);
static ether_return_t ether_set_promiscuous_mode (ether_param_t const control);
static ether_return_t ether_set_int_handler (ether_param_t const control);
static ether_return_t ether_power_on (ether_param_t const control);
static ether_return_t ether_power_off (ether_param_t const control);
static ether_return_t power_on (uint32_t channel);
static void power_off (uint32_t channel);
static ether_return_t ether_set_multicastframe_filter (ether_param_t const control);
static ether_return_t ether_set_broadcastframe_filter (ether_param_t const control);
static ether_return_t ether_receive_data_padding (ether_param_t const control);

#if (defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX72M) || \
    defined(BSP_MCU_RX72N) || defined(BSP_MCU_RX66N))
static void ether_eint0 (void * pparam);
#endif
#if (defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72M) || defined(BSP_MCU_RX72N))
static void ether_eint1(void * pparam);
#endif

static void ether_int_common (uint32_t channel);
static ether_return_t power_on_control (uint32_t channel);
static void power_off_control (uint32_t channel);
static uint8_t check_mpde_bit (void);

#if (ETHER_CFG_NON_BLOCKING == 1)
static ether_return_t ether_set_pmgi_callback(ether_param_t const control);
static uint16_t get_pmgi_channel(uint32_t channel);
static void set_ether_channel(uint32_t channel);
static ether_return_t pmgi_open_zc2_step0(uint32_t ether_channel);
static ether_return_t pmgi_open_zc2_step1(uint32_t ether_channel);
static ether_return_t pmgi_open_zc2_step2(uint32_t ether_channel);
static ether_return_t pmgi_open_zc2_step3(uint32_t ether_channel);
static ether_return_t pmgi_open_zc2_step4(uint32_t ether_channel);
static ether_return_t pmgi_open_zc2_step5(uint32_t ether_channel);
static ether_return_t pmgi_open_zc2_step6(uint32_t ether_channel);
static ether_return_t pmgi_checklink_zc_step0(uint32_t ether_channel);
static ether_return_t pmgi_checklink_zc_step1(uint32_t ether_channel);
static ether_return_t pmgi_linkprocess_step0(uint32_t ether_channel);
static ether_return_t pmgi_linkprocess_step1(uint32_t ether_channel);
static ether_return_t pmgi_linkprocess_step2(uint32_t ether_channel);
static ether_return_t pmgi_wakeonlan_step0(uint32_t ether_channel);
static ether_return_t pmgi_wakeonlan_step1(uint32_t ether_channel);
static ether_return_t pmgi_wakeonlan_step2(uint32_t ether_channel);
static ether_return_t pmgi_writephy_step0(uint32_t ether_channel);
static ether_return_t pmgi_readphy_step0(uint32_t ether_channel);
static ether_return_t pmgi_modestep_invalid(uint32_t ether_channel);
static const st_pmgi_interrupt_func_t PmgiAccessFun_tbl[PMGI_MODE_NUM][PMGI_STEP_NUM] =
{
    {
        { pmgi_open_zc2_step0 },
        { pmgi_open_zc2_step1 },
        { pmgi_open_zc2_step2 },
        { pmgi_open_zc2_step3 },
        { pmgi_open_zc2_step4 },
        { pmgi_open_zc2_step5 },
        { pmgi_open_zc2_step6 },
    },
    {
        { pmgi_checklink_zc_step0 },
        { pmgi_checklink_zc_step1 },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
    },
    {
        { pmgi_linkprocess_step0 },
        { pmgi_linkprocess_step1 },
        { pmgi_linkprocess_step2 },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
    },
    {
        { pmgi_wakeonlan_step0 },
        { pmgi_wakeonlan_step1 },
        { pmgi_wakeonlan_step2 },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
    },
    {
        { pmgi_open_zc2_step0 },
        { pmgi_open_zc2_step1 },
        { pmgi_open_zc2_step2 },
        { pmgi_open_zc2_step3 },
        { pmgi_open_zc2_step4 },
        { pmgi_open_zc2_step5 },
        { pmgi_open_zc2_step6 },
    },
    {
        { pmgi_checklink_zc_step0 },
        { pmgi_checklink_zc_step1 },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
    },
    {
        { pmgi_checklink_zc_step0 },
        { pmgi_checklink_zc_step1 },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
    },
    {
        { pmgi_checklink_zc_step0 },
        { pmgi_checklink_zc_step1 },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
    },
    {
        { pmgi_checklink_zc_step0 },
        { pmgi_checklink_zc_step1 },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
    },
    {
        { pmgi_writephy_step0 },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
    },
    {
        { pmgi_readphy_step0 },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
        { pmgi_modestep_invalid },
    },
};
#endif /* (ETHER_CFG_NON_BLOCKING == 1) */
/*
 * Private global variables
 */

/* Pointer to the receive descriptors */
#if (ETHER_CHANNEL_MAX == 1)
static descriptor_t * papp_rx_desc[ETHER_CHANNEL_MAX] =
{ NULL };
#elif (ETHER_CHANNEL_MAX == 2)
static descriptor_t * papp_rx_desc[ETHER_CHANNEL_MAX] =
{   NULL, NULL};
#endif

