nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/WolfSSLDemo/src/smc_gen/r_ether_rx/src/r_ether_rx.c
    if (false == R_BSP_SoftwareLock((BSP_CFG_USER_LOCKING_TYPE *)&g_phy_current_param[pmgi_channel].locked))
    {
        return ETHER_ERR_LOCKED;
    }
    set_ether_channel(channel);
#endif
#if (ETHER_CFG_NON_BLOCKING == 0)
    pether_ch = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    petherc_adr = pether_ch[phy_access].petherc;
    pedmac_adr = pether_ch[phy_access].pedmac;
#endif

    /* Initialize the flags */
    transfer_enable_flag[channel] = ETHER_FLAG_OFF;
    mpd_flag[channel] = ETHER_FLAG_OFF;
    lchng_flag[channel] = ETHER_FLAG_OFF;

    pause_frame_enable[channel] = pause;

    mac_addr_buf[channel][0] = mac_addr[0];
    mac_addr_buf[channel][1] = mac_addr[1];
    mac_addr_buf[channel][2] = mac_addr[2];
    mac_addr_buf[channel][3] = mac_addr[3];
    mac_addr_buf[channel][4] = mac_addr[4];
    mac_addr_buf[channel][5] = mac_addr[5];

#if (defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72M) || defined(BSP_MCU_RX72N))
    /* Subscribe to r_bsp an interrupt function */
    if (false == is_entry)
    {
        bsp_int_err = R_BSP_InterruptWrite(BSP_INT_SRC_AL1_EDMAC0_EINT0, ether_eint0); /* EINT0 */
        bsp_int_err = R_BSP_InterruptWrite(BSP_INT_SRC_AL1_EDMAC1_EINT1, ether_eint1); /* EINT1 */
        is_entry = true;
    }
#elif (defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX66N))
    /* Subscribe to r_bsp an interrupt function */
    if (false == is_entry)
    {
        bsp_int_err = R_BSP_InterruptWrite(BSP_INT_SRC_AL1_EDMAC0_EINT0, ether_eint0); /* EINT0 */
        is_entry = true;
    }
#endif

    /* Software reset */
    ether_reset_mac(channel);

#if (ETHER_CFG_NON_BLOCKING == 0)
    /* Software reset the PHY */
    phy_ret = phy_init(channel);
    if (R_PHY_OK == phy_ret)
    {
        phy_start_autonegotiate(channel, pause_frame_enable[channel]);

        /* Clear all ETHERC status BFR, PSRTO, LCHNG, MPD, ICD */
        petherc_adr->ECSR.LONG = 0x00000037;

        /* Clear all EDMAC status bits */
        pedmac_adr->EESR.LONG = 0x47FF0F9F;

#if (ETHER_CFG_USE_LINKSTA == 1)
        /* Enable interrupts of interest only. */
        petherc_adr->ECSIPR.BIT.LCHNGIP = 1;
#endif

        pedmac_adr->EESIPR.BIT.ECIIP = 1;

        /* Set Ethernet interrupt level and enable */
        ether_enable_icu(channel);

        ret = ETHER_SUCCESS;
    }
    else
    {
        ret = ETHER_ERR_OTHER;
    }

    return ret;
#elif (ETHER_CFG_NON_BLOCKING == 1)

    if (R_PHY_ERROR == pmgi_initial(pmgi_channel))
    {
        R_BSP_SoftwareUnlock((BSP_CFG_USER_LOCKING_TYPE * )&g_phy_current_param[pmgi_channel].locked);
        if ((NULL != cb_func.pcb_pmgi_hnd) && (FIT_NO_FUNC != cb_func.pcb_pmgi_hnd))
        {
            pmgi_cb_arg.channel = channel;
            pmgi_cb_arg.event = PMGI_ERROR;
            pmgi_cb_arg.mode = OPEN_ZC2;
            (*cb_func.pcb_pmgi_hnd)((void *)&pmgi_cb_arg);
        }
        return ETHER_ERR_OTHER;
    }

    g_phy_current_param[pmgi_channel].mode = OPEN_ZC2;
    g_phy_current_param[pmgi_channel].step = STEP0;
    g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

    pmgi_access(channel, PHY_REG_CONTROL, PHY_CONTROL_RESET, PMGI_WRITE);

    return ETHER_SUCCESS;
#endif

} /* End of function R_ETHER_Open_ZC2() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_Close_ZC2
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_Close_ZC2() function disables transmit and receive functionality on the ETHERC.
 *            This function does not put the ETHERC and EDMAC into the module stop state..
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @retval    ETHER_SUCCESS
 *            - Processing completed successfully.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @details   The R_ETHER_Close_ZC2() function disables transmit and receive functionality on the ETHERC and
 *            disables Ethernet interrupts. It does not put the ETHERC and EDMAC into the module stop state.\n
 *            Execute this function to end the Ethernet communication.
 * @note      None.
 */
ether_return_t R_ETHER_Close_ZC2(uint32_t channel)
{
    volatile struct st_etherc R_BSP_EVENACCESS_SFR * petherc_adr;
    volatile struct st_edmac R_BSP_EVENACCESS_SFR * pedmac_adr;
    const ether_control_t * pether_ch;
    uint32_t phy_access;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }

    pether_ch = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    petherc_adr = pether_ch[phy_access].petherc;
    pedmac_adr = pether_ch[phy_access].pedmac;

    /* Disable Ethernet interrupt. */
    ether_disable_icu(channel);

    petherc_adr->ECSIPR.BIT.LCHNGIP = 0;
    pedmac_adr->EESIPR.BIT.ECIIP = 0;

    /* Disable TE and RE  */
    petherc_adr->ECMR.LONG = 0x00000000;

    /* Initialize the flags */
    transfer_enable_flag[channel] = ETHER_FLAG_OFF;
    mpd_flag[channel] = ETHER_FLAG_OFF;
    lchng_flag[channel] = ETHER_FLAG_OFF;
#if (ETHER_CFG_USE_LINKSTA == 0)
    g_pre_link_stat[channel] = ETHER_ERR_OTHER;
#endif

    return ETHER_SUCCESS;
} /* End of function R_ETHER_Close_ZC2() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_Read_ZC2
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_Read_ZC2() function returns a pointer to the starting address of the buffer storing the
 *            receive data.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @param[out] **pbuf
 *             Returns a pointer to the starting address of the buffer storing the receive data.
 * @retval    A value of 1 or greater
 *            - Returns the number of bytes received.
 * @retval    ETHER_NO_DATA
 *            - A zero value indicates no data is received.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_INVALID_PTR
 *            - Value of the pointer is NULL or FIT_NO_PTR.
 * @retval    ETHER_ERR_LINK
 *            - Auto-negotiation is not completed, and reception is not enabled.
 * @retval    ETHER_ERR_MPDE
 *            - As a Magic Packet is being detected, transmission and reception is not enabled.
 * @retval    ETHER_ERR_MC_FRAME
 *            - Multicast frame detected when multicast frame filtering is enabled.
 * @details   The driver's buffer pointer to the starting address of the buffer storing the receive data
 *            is returned in the parameter pbuf. Returning the pointer allows the operation to be performed with
 *            zero-copy. Return value shows the number of received bytes. If there is no data available at the time
 *            of the call, ETHER_NO_DATA is returned. When auto-negotiation is not completed, and reception is not
 *            enabled, ETHER_ERR_LINK is returned. ETHER_ERR_MPDE is returned when a Magic Packet is being detected.\n
 *            The EDMAC hardware operates independent of the R_ETHER_Read_ZC2() function and reads data into a buffer
 *            pointed by the EDMAC receive descriptor. The buffer pointed by the EDMAC receive descriptor is
 *            statically allocated by the driver.\n
 *            When multicast frame filtering on the specified channel is enabled by the R_ETHER_Control function,
 *            the buffer is released immediately when a multicast frame is detected. Also, the value
 *            ETHER_ERR_MC_FRAME is returned. Note that when hardware-based multicast frame filtering is enabled
 *            on the RX64M, RX71M, RX72M, RX72N or RX66N, multicast frames are discarded by the hardware and
 *            detection is not possible.\n
 *            Frames that generate a receive FIFO overflow, residual-bit frame receive error, long frame receive
 *            error, short frame receive error, PHY-LSI receive error, or receive frame CRC error are treated
 *            as receive frame errors. When a receive frame error occurs, the descriptor data is discarded,
 *            the status is cleared, and reading of data continues.
 * @note      This function is used in combination with the R_ETHER_Read_ZC2_BufRelease function.
 *            Always call the R_ETHER_Read_ZC2 function and then the R_ETHER_Read_ZC2_BufRelease function
 *            in sequence. If the value ETHER_ERR_LINK is returned when this function is called,
 *            initialize the Ethernet FIT module.
 */
int32_t R_ETHER_Read_ZC2(uint32_t channel, void **pbuf)
{
    int32_t num_recvd;
    int32_t ret;
    int32_t complete_flag;
    int32_t ret2;
#if (1 == ETHER_CFG_EMAC_RX_DESCRIPTORS)
    volatile struct st_edmac R_BSP_EVENACCESS_SFR * pedmac_adr;
    const ether_control_t * pether_ch;
    uint32_t phy_access;
#endif
    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((NULL == pbuf) || (FIT_NO_PTR == pbuf))
    {
        return ETHER_ERR_INVALID_PTR;
    }

    /* When the Link up processing is not completed, return error */
    if (ETHER_FLAG_OFF == transfer_enable_flag[channel])
    {
        ret = ETHER_ERR_LINK;
    }

    /* In case of detection mode of magic packet, return error. */
    else if (1 == check_mpde_bit())
    {
        ret = ETHER_ERR_MPDE;
    }

