nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/WolfSSLDemo/src/smc_gen/r_ether_rx/src/r_ether_rx.c
    /* When the Link up processing is completed */
    else
    {
#if (1 == ETHER_CFG_EMAC_TX_DESCRIPTORS)
        pether_ch = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;
        pedmac_adr = pether_ch[phy_access].pedmac;
#endif

        /* All transmit buffers are full */
#if (1 == ETHER_CFG_EMAC_TX_DESCRIPTORS)
        if (0x00000000L != pedmac_adr->EDTRR.LONG)
#else
        if (TACT == (papp_tx_desc[channel]->status & TACT))
#endif
        {
            ret = ETHER_ERR_TACT;
        }
        else
        {
            /* Give application another buffer to work with */
            (*pbuf) = papp_tx_desc[channel]->buf_p;
            (*pbuf_size) = ETHER_CFG_BUFSIZE;
            ret = ETHER_SUCCESS;
        }
    }
    return ret;
} /* End of function R_ETHER_Write_ZC2_GetBuf() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_Write_ZC2_SetBuf
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_Write_ZC2_SetBuf() function enables the EDMAC to transmit the data in the transmit buffer.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @param[in] len
 *             Specifies the size (60 to 1,514 bytes) which is the Ethernet frame length minus 4 bytes of CRC.
 * @retval    ETHER_SUCCESS
 *            - Processing completed successfully.
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_INVALID_PTR
 *            - Value of the pointer is NULL or FIT_NO_PTR.
 * @retval    ETHER_ERR_LINK
 *            - Auto-negotiation is not completed, and reception is not enabled.
 * @retval    ETHER_ERR_MPDE
 *            - As a Magic Packet is being detected, transmission and reception is not enabled.
 * @details   Call this function after writing one frame of transmit data is completed.\n
 *            Set the buffer length to be not less than 60 bytes (64 bytes of the minimum Ethernet frame minus 4 bytes
 *            of CRC) and not more than 1,514 bytes (1,518 bytes of the maximum Ethernet frame minus 4 bytes of CRC).\n
 *            To transmit data less than 60 bytes, make sure to pad the data with zero to be 60 bytes.\n
 *            Return values indicate that the data written in the transmit buffer is enabled to be transmitted.\n
 *            ETHER_SUCCESS is returned when the data in the transmit buffer is enabled to be transmitted at the time
 *            of the call. When auto-negotiation is not completed, and transmission is not enabled,
 *            ETHER_ERR_LINK is returned. ETHER_ERR_MPDE is returned when a Magic Packet is being detected.
 * @note      1.Call this function after writing one frame of transmit data is completed.\n
 *            2.To transmit data less than 60 bytes, make sure to pad the data with zero to be 60 bytes.\n
 *            3.Before calling this function, use the R_ETHER_Write_ZC2_GetBuf function to read data.
 *              Call this function after ETHER_SUCCESS is returned.\n
 *            4.This function is used in combination with the R_ETHER_Write_ZC2_GetBuf function.
 *              Always call the R_ETHER_Write_ZC2_GetBuf function and then the R_ETHER_Write_ZC2_SetBuf
 *              function in sequence. If the value ETHER_ERR_LINK is returned when this function is called,
 *              initialize the Ethernet FIT module.
 */
ether_return_t R_ETHER_Write_ZC2_SetBuf(uint32_t channel, const uint32_t len)
{
    ether_return_t ret;
    volatile struct st_edmac R_BSP_EVENACCESS_SFR * pedmac_adr;
    const ether_control_t * pether_ch;
    uint32_t phy_access;

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }
    if ((ETHER_BUFSIZE_MIN > len) || (ETHER_BUFSIZE_MAX < len))
    {
        return ETHER_ERR_INVALID_DATA;
    }

    /* When the Link up processing is not completed, return error */
    if (ETHER_FLAG_OFF == transfer_enable_flag[channel])
    {
        ret = ETHER_ERR_LINK;
    }

    /* In case of detection mode of magic packet, return error. */
    else if (1 == check_mpde_bit())

    {
        ret = ETHER_ERR_MPDE;
    }

    /* When the Link up processing is completed */
    else
    {
        /* The data of the buffer is made active.  */
        papp_tx_desc[channel]->bufsize = len;
        papp_tx_desc[channel]->status &= (~(TFP1 | TFP0));
        papp_tx_desc[channel]->status |= ((TFP1 | TFP0) | TACT);
        papp_tx_desc[channel] = papp_tx_desc[channel]->next;

        pether_ch = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;
        pedmac_adr = pether_ch[phy_access].pedmac;

        if (0x00000000L == pedmac_adr->EDTRR.LONG)
        {
            /* Restart if stopped */
            pedmac_adr->EDTRR.LONG = 0x00000001L;
        }

        ret = ETHER_SUCCESS;
    }
    return ret;
} /* End of function R_ETHER_Write_ZC2_SetBuf() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_CheckLink_ZC
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_CheckLink_ZC() function checks the status of the physical Ethernet link
 *            using PHY management interface. Ethernet link is up when the cable is connected to a peer device
 *            whose PHY is properly initialized.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @retval    ETHER_SUCCESS
 *            - the link status is link up or the operation starts normally when the non-blocking mode is enabled.
 * @retval    ETHER_ERR_OTHER
 *            - the link status is link-down or the non-blocking mode is enabled and the interrupt handler function
 *              is not registered
 * @retval    ETHER_ERR_INVALID_CHAN
 *            - Nonexistent channel number.
 * @retval    ETHER_ERR_LOCKED
 *            - When PHY access is in progress when non-blocking mode is enabled .
 * @details   The R_ETHER_CheckLink_ZC() function checks the status of the physical Ethernet link
 *            using PHY management interface. This information (status of Ethernet link) is read from
 *            the basic status register (register 1) of the PHY-LSI device. If non-blocking mode is disabled,
 *            ETHER_SUCCESS is returned when the link is up, and ETHER_ERR_OTHER when the link is down.\n
 *            When non-blocking mode is enabled, the check result is passed as an argument of
 *            the interrupt handler function after the link status check is completed.
 * @note      None.
 */
ether_return_t R_ETHER_CheckLink_ZC(uint32_t channel)
{
#if (ETHER_CFG_NON_BLOCKING == 0)
    int16_t status;
#endif
#if (ETHER_CFG_NON_BLOCKING == 1)
    uint16_t pmgi_channel;
    pmgi_cb_arg_t pmgi_cb_arg;
    uint16_t reg = 0;
#endif

    /* Check argument */
    if (ETHER_CHANNEL_MAX <= channel)
    {
        return ETHER_ERR_INVALID_CHAN;
    }

#if (ETHER_CFG_NON_BLOCKING == 1)
    if (NULL == cb_func.pcb_pmgi_hnd)
    {
        return ETHER_ERR_OTHER;
    }

    pmgi_channel = get_pmgi_channel(channel);

