nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/WolfSSLDemo/src/smc_gen/r_ether_rx/src/r_ether_rx.c
    if (false == R_BSP_SoftwareLock((BSP_CFG_USER_LOCKING_TYPE *)&g_phy_current_param[pmgi_channel].locked))
    {
        return ETHER_ERR_LOCKED;
    }
    set_ether_channel(channel);

    if (R_PHY_ERROR == pmgi_initial(pmgi_channel))
    {
        R_BSP_SoftwareUnlock((BSP_CFG_USER_LOCKING_TYPE * )&g_phy_current_param[pmgi_channel].locked);
        if ((NULL != cb_func.pcb_pmgi_hnd) && (FIT_NO_FUNC != cb_func.pcb_pmgi_hnd))
        {
            pmgi_cb_arg.channel = channel;
            pmgi_cb_arg.event = PMGI_ERROR;
            pmgi_cb_arg.mode = CHECKLINK_ZC;
            (*cb_func.pcb_pmgi_hnd)((void *)&pmgi_cb_arg);
        }
        return ETHER_ERR_OTHER;
    }

    g_phy_current_param[pmgi_channel].mode = CHECKLINK_ZC;

    g_phy_current_param[pmgi_channel].step = STEP0;
    g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

    pmgi_access(channel, PHY_REG_STATUS, reg, PMGI_READ);

    return ETHER_SUCCESS;
#elif ETHER_CFG_NON_BLOCKING == 0
    status = phy_get_link_status(channel);

    if (R_PHY_ERROR == status)
    {
        /* Link is down */
        return ETHER_ERR_OTHER;
    }
    else
    {
        /* Link is up */
        return ETHER_SUCCESS;
    }
#endif

} /* End of function R_ETHER_CheckLink_ZC() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_LinkProcess
 *****************************************************************************************************************/ /**
 * @brief     The R_ETHER_LinkProcess() function performs link signal change interrupt processing and
 *            Magic Packet detection interrupt processing.
 * @param[in] channel
 *             Specifies the ETHERC and EDMAC channel number (0 or 1).
 *             This value must be specified as 0 on products with only one ETHERC and EDMAC channel.
 * @retval    None.
 * @details   Note that link status change detection processing takes place but link signal change interrupt
 *            processing does not occur when ETHER_CFG_USE_LINKSTA is set to a value of 0.
 *            When non-blocking mode is enabled, the processing result of the function is passed as an argument of
 *            the PMGI callback function.
 *            See Section 3.9 in the application note for more details.
 * @note      1.If ETHER_CFG_USE_LINKSTA is set to a value of 1, either call this function periodically within the
 *              normal processing routine. Note that Ethernet transmission and reception may not operate correctly,
 *              and the Ethernet driver may not enter Magic Packet detection mode correctly, if this function
 *              is not called.
 *            2.If ETHER_CFG_USE_LINKSTA is set to a value of 0, either call this function periodically within the
 *              normal processing routine, or call it from an interrupt function that is processed when a periodically
 *              occurring interrupt source occurs. Note that Ethernet transmission and reception may
 *              not operate correctly, and the Ethernet driver may not enter Magic Packet detection mode correctly,
 *              if this function is not called.
 *            3.If no callback function was registered with the function R_ETHER_Control(),
 *              there will be no notification by a callback function.
 */
void R_ETHER_LinkProcess(uint32_t channel)
{

#if (ETHER_CFG_NON_BLOCKING == 0)
    volatile struct st_etherc R_BSP_EVENACCESS_SFR * petherc_adr;
    const ether_control_t * pether_ch;
    uint32_t phy_access;
    int32_t ret;
#endif

#if (ETHER_CFG_NON_BLOCKING == 1)
    volatile bsp_int_err_t bsp_int_err;
    uint16_t pmgi_channel;
    pmgi_cb_arg_t pmgi_cb_arg;
    uint16_t reg_data = 0;
#endif
    ether_cb_arg_t cb_arg;

    if (ETHER_CHANNEL_MAX <= channel)
    {
        return;
    }
#if (ETHER_CFG_NON_BLOCKING == 1)

    if (NULL == cb_func.pcb_pmgi_hnd)
    {
        return;
    }

    pmgi_channel = get_pmgi_channel(channel);

    if (false == R_BSP_SoftwareLock((BSP_CFG_USER_LOCKING_TYPE *)&g_phy_current_param[pmgi_channel].locked))
    {
        R_BSP_NOP();
        return;
    }

    set_ether_channel(channel);

    if (R_PHY_ERROR == pmgi_initial(pmgi_channel))
    {
        R_BSP_SoftwareUnlock((BSP_CFG_USER_LOCKING_TYPE * )&g_phy_current_param[pmgi_channel].locked);
        if ((NULL != cb_func.pcb_pmgi_hnd) && (FIT_NO_FUNC != cb_func.pcb_pmgi_hnd))
        {
            pmgi_cb_arg.channel = channel;
            pmgi_cb_arg.event = PMGI_ERROR;
            pmgi_cb_arg.mode = LINKPROCESS;
            (*cb_func.pcb_pmgi_hnd)((void *)&pmgi_cb_arg);
        }
        return;
    }
#endif

    /* When the magic packet is detected. */
    if (ETHER_FLAG_ON == mpd_flag[channel])
    {
        mpd_flag[channel] = ETHER_FLAG_OFF;

        if ((NULL != cb_func.pcb_func) && (FIT_NO_FUNC != cb_func.pcb_func))
        {
            cb_arg.channel = channel;
            cb_arg.event_id = ETHER_CB_EVENT_ID_WAKEON_LAN;
            (*cb_func.pcb_func)((void *) &cb_arg);
        }

        /*
         * After the close function is called, the open function is called 
         * to have to set ETHERC to a usual operational mode
         * to usually communicate after magic packet is detected. 
         */
        R_ETHER_Close_ZC2(channel);
#if (ETHER_CFG_NON_BLOCKING == 1)

        /* Initialize the flags */
        transfer_enable_flag[channel] = ETHER_FLAG_OFF;
        mpd_flag[channel] = ETHER_FLAG_OFF;
        lchng_flag[channel] = ETHER_FLAG_OFF;

    #if (defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX72M) || defined(BSP_MCU_RX72N))
        /* Subscribe to r_bsp an interrupt function */
        if (false == is_entry)
        {
            bsp_int_err = R_BSP_InterruptWrite(BSP_INT_SRC_AL1_EDMAC0_EINT0, ether_eint0); /* EINT0 */
            bsp_int_err = R_BSP_InterruptWrite(BSP_INT_SRC_AL1_EDMAC1_EINT1, ether_eint1); /* EINT1 */
            is_entry = true;
        }
    #elif (defined(BSP_MCU_RX65N) || defined(BSP_MCU_RX66N))
        /* Subscribe to r_bsp an interrupt function */
        if (false == is_entry)
        {
            bsp_int_err = R_BSP_InterruptWrite(BSP_INT_SRC_AL1_EDMAC0_EINT0, ether_eint0); /* EINT0 */
            is_entry = true;
        }
    #endif

        /* Software reset */
        ether_reset_mac(channel);

