nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/WolfSSLDemo/src/smc_gen/r_ether_rx/src/r_ether_rx.c
    if (false == R_BSP_SoftwareLock((BSP_CFG_USER_LOCKING_TYPE * )&g_phy_current_param[pmgi_channel].locked))
    {
        return ETHER_ERR_LOCKED;
    }

    set_ether_channel(channel);

    if (R_PHY_ERROR == pmgi_initial(pmgi_channel))
    {
        R_BSP_SoftwareUnlock((BSP_CFG_USER_LOCKING_TYPE * )&g_phy_current_param[pmgi_channel].locked);
        return ETHER_ERR_OTHER;
    }

    g_phy_current_param[pmgi_channel].mode = READPHY;
    g_phy_current_param[pmgi_channel].step = STEP0;

    pmgi_access(channel, address, *p_data, PMGI_READ);

#elif (ETHER_CFG_NON_BLOCKING == 0)
    *p_data = phy_read(channel, address);
#endif

    return ETHER_SUCCESS;
} /* End of function R_ETHER_ReadPHY() */

/**********************************************************************************************************************
 * Function Name: R_ETHER_GetVersion
 *****************************************************************************************************************/ /**
 * @brief     This function returns the API version.
 * @return    Version number.
 * @details   Returns the API version number.
 * @note      None
 */
uint32_t R_ETHER_GetVersion(void)
{
    return ((((uint32_t) ETHER_RX_VERSION_MAJOR) << 16) | ((uint32_t) ETHER_RX_VERSION_MINOR));
} /* End of function R_ETHER_GetVersion() */

/*
 * Private functions
 */

/***********************************************************************************************************************
 * Function Name: ether_reset_mac
 * Description  : The EDMAC and EtherC are reset through the software reset.
 * Arguments    : channel -
 *                    ETHERC channel number
 * Return Value : none
 ***********************************************************************************************************************/
static void ether_reset_mac(uint32_t channel)
{
    volatile uint32_t i;

    /* Software reset */
#if (ETHER_CHANNEL_MAX == 1)
    if (ETHER_CHANNEL_0 == channel)
    {
        EDMAC0.EDMR.BIT.SWR = 1;
    }
#elif (ETHER_CHANNEL_MAX == 2)
    if (ETHER_CHANNEL_0 == channel)
    {
        EDMAC0.EDMR.BIT.SWR = 1;
    }
    else
    {
        EDMAC1.EDMR.BIT.SWR = 1;
    }
#endif

    /*
     * Waiting time until the initialization of ETHERC and EDMAC is completed is 64 cycles
     * in the clock conversion of an internal bus of EDMAC. 
     */
    /* WAIT_LOOP */
    for (i = 0; i < 0x00000180; i++)
    {
        ;
    }

} /* End of function ether_reset_mac() */

/***********************************************************************************************************************
 * Function Name: ether_init_descriptors
 * Description  : The EDMAC descriptors and the driver buffers are initialized.
 * Arguments    : channel -
 *                    ETHERC channel number
 * Return Value : none
 ***********************************************************************************************************************/
static void ether_init_descriptors(uint32_t channel)
{
    descriptor_t * pdescriptor;
    uint32_t i;

    /* Initialize the receive descriptors */
    /* WAIT_LOOP */
    for (i = 0; i < ETHER_CFG_EMAC_RX_DESCRIPTORS; i++)
    {
        pdescriptor = (descriptor_t *) &rx_descriptors[channel][i];
        pdescriptor->buf_p = (uint8_t *) &(ether_buffers[channel].buffer[i][0]);
        pdescriptor->bufsize = ETHER_CFG_BUFSIZE;
        pdescriptor->size = 0;
        pdescriptor->status = RACT;
        pdescriptor->next = (descriptor_t *) &rx_descriptors[channel][(i + 1)];
    }

    /* The last descriptor points back to the start */
    pdescriptor->status |= RDLE;
    pdescriptor->next = (descriptor_t *) &rx_descriptors[channel][0];

    /* Initialize application receive descriptor pointer */
    papp_rx_desc[channel] = (descriptor_t *) &rx_descriptors[channel][0];

    /* Initialize the transmit descriptors */
    /* WAIT_LOOP */
    for (i = 0; i < ETHER_CFG_EMAC_TX_DESCRIPTORS; i++)
    {
        pdescriptor = (descriptor_t *) &tx_descriptors[channel][i];
        pdescriptor->buf_p = (uint8_t *) &(ether_buffers[channel].buffer[(ETHER_CFG_EMAC_RX_DESCRIPTORS + i)][0]);
        pdescriptor->bufsize = 1; /* Set a value equal to or greater than 1. (reference to UMH)
         When transmitting data, the value of size is set to the function argument
         R_ETHER_Write_ZC2_SetBuf. */
        pdescriptor->size = 0; /* Reserved : The write value should be 0. (reference to UMH) */
        pdescriptor->status = 0;
        pdescriptor->next = (descriptor_t *) &(tx_descriptors[channel][(i + 1)]);
    }

    /* The last descriptor points back to the start */
    pdescriptor->status |= TDLE;
    pdescriptor->next = (descriptor_t *) &tx_descriptors[channel][0];

    /* Initialize application transmit descriptor pointer */
    papp_tx_desc[channel] = (descriptor_t *) &tx_descriptors[channel][0];
} /* End of function ether_init_descriptors() */

/***********************************************************************************************************************
 * Function Name: ether_config_ethernet
 * Description  : Configure the Ethernet Controller (EtherC) and the Ethernet
 *                Direct Memory Access controller (EDMAC).
 * Arguments    : channel -
 *                    ETHERC channel number
 *                mode - 
 *                   The operational mode is specified. 
 *                   NO_USE_MAGIC_PACKET_DETECT (0) - Communicate mode usually
 *                   USE_MAGIC_PACKET_DETECT    (1) - Magic packet detection mode
 * Return Value : none
 ***********************************************************************************************************************/
static void ether_config_ethernet(uint32_t channel, const uint8_t mode)
{
    volatile struct st_etherc R_BSP_EVENACCESS_SFR * petherc_adr;
    volatile struct st_edmac R_BSP_EVENACCESS_SFR * pedmac_adr;
    const ether_control_t * pether_ch;
    uint32_t phy_access;

    if (ETHER_CHANNEL_MAX <= channel)
    {
        return;
    }

    pether_ch = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    petherc_adr = pether_ch[phy_access].petherc;
    pedmac_adr = pether_ch[phy_access].pedmac;

