nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/WolfSSLDemo/src/smc_gen/r_ether_rx/src/r_ether_rx.c
    }
} /* End of function ether_pmgi0i_isr() */
#endif /* (ETHER_CFG_CH0_PHY_ACCESS == 0) || (ETHER_CFG_CH1_PHY_ACCESS == 0) */

#if (PMGI_CHANNEL_MAX ==2)
#if (ETHER_CFG_CH0_PHY_ACCESS == 1) || (ETHER_CFG_CH1_PHY_ACCESS == 1)
/******************************************************************************
* Function Name:    ether_pmgi1i_isr
* Description  :    PMGI1 complete ISR.
*                   Each ISR calls a common function but passes its channel number.
* Arguments    :    N/A
* Return Value :    N/A
******************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(ether_pmgi1i_isr, VECT_PMGI1_PMGI1I)
R_BSP_ATTRIB_STATIC_INTERRUPT void ether_pmgi1i_isr(void)
{
    pmgi_cb_arg_t           cb_arg;
    pmgi_mode_t             mode;
    uint32_t                ether_channel;
    pmgi_step_t             step;
    pmgi_event_t            event;

    mode            = g_phy_current_param[PMGI_CHANNEL_1].mode;
    step            = g_phy_current_param[PMGI_CHANNEL_1].step;
    ether_channel   = g_phy_current_param[PMGI_CHANNEL_1].ether_channel;

    if (PmgiAccessFun_tbl[mode][step].p_func(ether_channel) != ETHER_SUCCESS)
    {
        g_phy_current_param[PMGI_CHANNEL_1].event = PMGI_ERROR;
    }

    event = g_phy_current_param[PMGI_CHANNEL_1].event;
    if ((PMGI_COMPLETE == event) || (PMGI_ERROR == event))
    {
        R_BSP_SoftwareUnlock((BSP_CFG_USER_LOCKING_TYPE * )&g_phy_current_param[PMGI_CHANNEL_1].locked);
        if ((NULL != cb_func.pcb_pmgi_hnd) && (FIT_NO_FUNC != cb_func.pcb_pmgi_hnd))
        {
            if (PMGI_COMPLETE == event)
            {
                cb_arg.event = PMGI_COMPLETE;
                cb_arg.mode = g_phy_current_param[PMGI_CHANNEL_1].mode;
            }
            else
            {
                cb_arg.event = PMGI_ERROR;
                cb_arg.mode = g_phy_current_param[PMGI_CHANNEL_1].mode;
            }
            cb_arg.channel = ether_channel;
            cb_arg.reg_data = g_phy_current_param[PMGI_CHANNEL_1].read_data;
            /* set PMGI parameters to default */
            g_phy_current_param[PMGI_CHANNEL_1].event = PMGI_IDLE;
            g_phy_current_param[PMGI_CHANNEL_1].mode = OPEN_ZC2;
            g_phy_current_param[PMGI_CHANNEL_1].step = STEP0;
            pmgi_close(PMGI_CHANNEL_1);
            (*cb_func.pcb_pmgi_hnd)((void *)&cb_arg);
        }
    }
    else
    {

    }
} /* End of function ether_pmgi1i_isr() */
#endif /* (ETHER_CFG_CH0_PHY_ACCESS == 1) || (ETHER_CFG_CH1_PHY_ACCESS == 1) */
#endif /* (PMGI_CHANNEL_MAX ==2) */

/******************************************************************************
* Function Name:    pmgi_open_zc2_step0
* Description  :    Processing after R_ETHER_Open_ZC2'step0 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_open_zc2_step0(uint32_t channel)
{
    ether_return_t  ret = ETHER_SUCCESS;
    uint16_t        pmgi_channel;
    uint16_t        reg = 0;

    pmgi_channel = get_pmgi_channel(channel);

    /* set the current parameter of phy */
    g_phy_current_param[pmgi_channel].step = STEP1;
    g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;
    g_phy_current_param[pmgi_channel].reset_counter = 0;

    pmgi_access(channel, PHY_REG_CONTROL, reg, PMGI_READ);

    return ret;
} /* End of function pmgi_open_zc2_step0() */

/******************************************************************************
* Function Name:    pmgi_open_zc2_step1
* Description  :    Processing after R_ETHER_Open_ZC2'step1 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_open_zc2_step1(uint32_t channel)
{
    ether_return_t          ret = ETHER_SUCCESS;
    uint16_t                pmgi_channel;
    uint16_t                reg;
    uint16_t                data = 0;

    pmgi_channel = get_pmgi_channel(channel);

    reg = pmgi_read_reg(pmgi_channel);
    if (reg & PHY_CONTROL_RESET)
    {
        pmgi_access(channel, PHY_REG_CONTROL, data, PMGI_READ);

        /* set the current parameter of phy */
        g_phy_current_param[pmgi_channel].reset_counter ++;
    }
    else
    {
#if ETHER_CFG_USE_PHY_KSZ8041NL == 1
        g_phy_current_param[pmgi_channel].step = STEP2;
        g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;
        pmgi_access(channel, PHY_REG_PHY_CONTROL_1, data, PMGI_READ);

#elif ETHER_CFG_USE_PHY_KSZ8041NL == 0
        g_phy_current_param[pmgi_channel].step = STEP4;
        g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

        if (ETHER_FLAG_OFF == pause_frame_enable[channel])
        {
            local_advertise[channel] = ((((PHY_AN_ADVERTISEMENT_100F |
            PHY_AN_ADVERTISEMENT_100H) |
            PHY_AN_ADVERTISEMENT_10F) |
            PHY_AN_ADVERTISEMENT_10H) |
            PHY_AN_ADVERTISEMENT_SELECTOR);
        }

        /* When pause frame is used */
        else
        {
            local_advertise[channel] = ((((((PHY_AN_ADVERTISEMENT_ASM_DIR |
            PHY_AN_ADVERTISEMENT_PAUSE) |
            PHY_AN_ADVERTISEMENT_100F) |
            PHY_AN_ADVERTISEMENT_100H) |
            PHY_AN_ADVERTISEMENT_10F) |
            PHY_AN_ADVERTISEMENT_10H) |
            PHY_AN_ADVERTISEMENT_SELECTOR);
        }

        pmgi_access(channel, PHY_REG_AN_ADVERTISEMENT, local_advertise[channel], PMGI_WRITE);

#endif
    }

    if (g_phy_current_param[pmgi_channel].reset_counter >= ETHER_CFG_PHY_DELAY_RESET)
    {
        ret = ETHER_ERR_OTHER;
    }

    return ret;
} /* End of function pmgi_open_zc2_step1() */

#if ETHER_CFG_USE_PHY_KSZ8041NL == 1
/******************************************************************************
* Function Name:    pmgi_open_zc2_step2
* Description  :    Processing after R_ETHER_Open_ZC2'step2 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_open_zc2_step2(uint32_t channel)
{
    ether_return_t          ret = ETHER_SUCCESS;
    uint16_t                pmgi_channel;
    uint16_t                reg;

    pmgi_channel = get_pmgi_channel(channel);

    reg = pmgi_read_reg(pmgi_channel);
    reg &= (~0x8000);
    reg |= 0x4000;

    /* set the current parameter of phy */
    g_phy_current_param[pmgi_channel].step = STEP3;
    g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

    pmgi_access(channel, PHY_REG_PHY_CONTROL_1, reg, PMGI_WRITE);

    return ret;
} /* End of function pmgi_open_zc2_step2() */

