nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/WolfSSLDemo/src/smc_gen/r_ether_rx/src/r_ether_rx.c
#elif (ETHER_CFG_USE_LINKSTA == 1)
        if (ETHER_FLAG_ON_LINK_ON == lchng_flag[channel])
        {
            /* set the current parameter of phy */
            g_phy_current_param[pmgi_channel].mode = LINKPROCESS_CHECKLINK_ZC1;
            g_phy_current_param[pmgi_channel].step = STEP0;
            g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;
            pmgi_access(channel, PHY_REG_STATUS, reg, PMGI_READ);
        }
        else if (ETHER_FLAG_ON_LINK_OFF == lchng_flag[channel])
        {
            lchng_flag[channel] = ETHER_FLAG_OFF;
            /* set the current parameter of phy */
            g_phy_current_param[pmgi_channel].mode = LINKPROCESS_CHECKLINK_ZC2;
            g_phy_current_param[pmgi_channel].step = STEP0;
            g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;
            pmgi_access(channel, PHY_REG_STATUS, reg, PMGI_READ);
        }
        else
        {
            g_phy_current_param[channel].mode = LINKPROCESS;
            g_phy_current_param[pmgi_channel].event = PMGI_COMPLETE;
        }
#endif
    }
    else
    {

        /* PMGI access complete */
        g_phy_current_param[pmgi_channel].event = PMGI_COMPLETE;
        g_phy_current_param[pmgi_channel].read_data = reg;
    }

    return ret;
} /* End of function pmgi_open_zc2_step6() */

/******************************************************************************
* Function Name:    pmgi_checklink_zc_step0
* Description  :    Processing after R_ETHER_CHECKLINK_ZC'step0 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_checklink_zc_step0(uint32_t channel)
{
    ether_return_t      ret = ETHER_SUCCESS;
    uint16_t            pmgi_channel;
    uint16_t            reg = 0;

    pmgi_channel = get_pmgi_channel(channel);

    /* set the current parameter of phy */
    g_phy_current_param[pmgi_channel].step = STEP1;
    g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;
    pmgi_access(channel, PHY_REG_STATUS, reg, PMGI_READ);

    return ret;
} /* End of function pmgi_checklink_zc_step0() */

/******************************************************************************
* Function Name:    pmgi_checklink_zc_step1
* Description  :    Processing after R_ETHER_CHECKLINK_ZC'step1 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_checklink_zc_step1(uint32_t channel)
{
    ether_return_t                                      ret = ETHER_SUCCESS;
    volatile struct st_etherc R_BSP_EVENACCESS_SFR *    petherc_adr;
    const ether_control_t *                             pether_ch;
    uint32_t                                            phy_access;
    ether_cb_arg_t                                      cb_arg;
    uint16_t                                            pmgi_channel;
    uint16_t                                            reg;
#if (ETHER_CFG_USE_LINKSTA == 0)
    int16_t                                             link_status;
#endif

    pmgi_channel = get_pmgi_channel(channel);

    if ((CHECKLINK_ZC == g_phy_current_param[pmgi_channel].mode))
    {
        reg = pmgi_read_reg(pmgi_channel);
        if (PHY_STATUS_LINK_UP != (reg & PHY_STATUS_LINK_UP))
        {
            g_phy_current_param[pmgi_channel].read_data = reg;
            g_phy_current_param[pmgi_channel].event = PMGI_ERROR;
        }
        else
        {
            /* set the current parameter of phy */
            g_phy_current_param[pmgi_channel].read_data = reg;
            g_phy_current_param[pmgi_channel].event = PMGI_COMPLETE;
        }
    }
    else if (LINKPROCESS_CHECKLINK_ZC0 == g_phy_current_param[pmgi_channel].mode)
    {
#if (ETHER_CFG_USE_LINKSTA == 0)
        reg = pmgi_read_reg(pmgi_channel);

        if (PHY_STATUS_LINK_UP != (reg & PHY_STATUS_LINK_UP))
        {
            link_status = ETHER_ERR_OTHER;
        }
        else
        {
            link_status = ETHER_SUCCESS;
        }

        if (g_pre_link_stat[channel] != link_status)
        {
            if (ETHER_SUCCESS == (ether_return_t)link_status)
            {
                /* The state of the link status in PHY-LSI is confirmed and Link Up/Down is judged. */
                /* When becoming Link up */
                lchng_flag[channel] = ETHER_FLAG_ON_LINK_ON;
            }
            else
            {
                /* When becoming Link down */
                lchng_flag[channel] = ETHER_FLAG_ON_LINK_OFF;
            }
        }
        g_pre_link_stat[channel] = link_status;

        if (ETHER_FLAG_ON_LINK_ON == lchng_flag[channel])
        {
            /*
            * The status of the LINK signal became "link-up" even if PHY-LSI did not detect "link-up"
            * after a reset. To avoid this wrong detection, processing in R_ETHER_LinkProcess has been modified to
            * clear the flag after link-up is confirmed in R_ETHER_CheckLink_ZC.
            */
            lchng_flag[channel] = ETHER_FLAG_OFF;

            /* Initialize the transmit and receive descriptor */
            memset((void *)&rx_descriptors[channel], 0x00, sizeof(rx_descriptors[channel]));
            memset((void *)&tx_descriptors[channel], 0x00, sizeof(tx_descriptors[channel]));

            /* Initialize the Ether buffer */
            memset(&ether_buffers[channel], 0x00, sizeof(ether_buffers[channel]));

            transfer_enable_flag[channel] = ETHER_FLAG_ON;

            /*
            * ETHERC and EDMAC are set after ETHERC and EDMAC are reset in software
            * and sending and receiving is permitted.
            */
            ether_configure_mac(channel, mac_addr_buf[channel], NO_USE_MAGIC_PACKET_DETECT);

