nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/WolfSSLDemo/src/smc_gen/r_ether_rx/src/r_ether_rx.c
            /* set PMGI current parameter */
            g_phy_current_param[pmgi_channel].mode = LINKPROCESS;
            g_phy_current_param[pmgi_channel].step = STEP0;
            g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;
            /* PMGI access  */
            pmgi_access(channel, PHY_REG_STATUS, reg, PMGI_READ);

            return ret;
        }
        else if (ETHER_FLAG_ON_LINK_OFF == lchng_flag[channel])
        {
            pether_ch = g_eth_control_ch[channel].pether_control;
            phy_access = g_eth_control_ch[channel].phy_access;
            petherc_adr = pether_ch[phy_access].petherc;

            /* Disable receive and transmit. */
            petherc_adr->ECMR.BIT.RE = 0;
            petherc_adr->ECMR.BIT.TE = 0;

            transfer_enable_flag[channel] = ETHER_FLAG_OFF;

            if ((NULL != cb_func.pcb_func) && (FIT_NO_FUNC != cb_func.pcb_func))
            {
                cb_arg.channel = channel;
                cb_arg.event_id = ETHER_CB_EVENT_ID_LINK_OFF;
                (*cb_func.pcb_func)((void *) &cb_arg);
            }

            /* PMGI access complete */
            g_phy_current_param[pmgi_channel].mode = LINKPROCESS;
            g_phy_current_param[pmgi_channel].event = PMGI_COMPLETE;
            g_phy_current_param[pmgi_channel].mode = LINKPROCESS;
            ret = ETHER_ERR_OTHER;
            return ret;
        }
        else
        {
            g_phy_current_param[pmgi_channel].mode = LINKPROCESS;
            g_phy_current_param[pmgi_channel].event = PMGI_COMPLETE;
        }
#elif (ETHER_CFG_USE_LINKSTA == 1)
        ret = ETHER_ERR_OTHER;
        g_phy_current_param[pmgi_channel].mode = LINKPROCESS;
        return ret;
#endif
    }
    else if (LINKPROCESS_CHECKLINK_ZC1 == g_phy_current_param[pmgi_channel].mode)
    {
#if (ETHER_CFG_USE_LINKSTA == 0)
        ret = ETHER_ERR_OTHER;
        g_phy_current_param[pmgi_channel].mode = LINKPROCESS;
        return ret;
#elif (ETHER_CFG_USE_LINKSTA == 1)
        reg = pmgi_read_reg(pmgi_channel);

        if (PHY_STATUS_LINK_UP != (reg & PHY_STATUS_LINK_UP))
        {
            R_BSP_NOP();

            /* Link is down */
            g_phy_current_param[pmgi_channel].mode = LINKPROCESS;
            ret = ETHER_ERR_OTHER;
            return ret;
        }
        else
        {
            /*
             * The status of the LINK signal became "link-up" even if PHY-LSI did not detect "link-up"
             * after a reset. To avoid this wrong detection, processing in R_ETHER_LinkProcess has been modified to
             * clear the flag after link-up is confirmed in R_ETHER_CheckLink_ZC.
             */
            lchng_flag[channel] = ETHER_FLAG_OFF;

            /* Initialize the transmit and receive descriptor */
            memset((void *)&rx_descriptors[channel], 0x00, sizeof(rx_descriptors[channel]));
            memset((void *)&tx_descriptors[channel], 0x00, sizeof(tx_descriptors[channel]));

            /* Initialize the Ether buffer */
            memset(&ether_buffers[channel], 0x00, sizeof(ether_buffers[channel]));

            transfer_enable_flag[channel] = ETHER_FLAG_ON;

            /*
             * ETHERC and EDMAC are set after ETHERC and EDMAC are reset in software
             * and sending and receiving is permitted.
             */
            ether_configure_mac(channel, mac_addr_buf[channel], NO_USE_MAGIC_PACKET_DETECT);

            /* set PMGI current parameters */
            g_phy_current_param[pmgi_channel].mode = LINKPROCESS;
            g_phy_current_param[pmgi_channel].step = STEP0;
            g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

            /* PMGI Read */

            pmgi_access(channel, PHY_REG_STATUS, reg, PMGI_READ);

            return ret;
        }
#endif /* (ETHER_CFG_USE_LINKSTA == 0) */
    }
    else if (LINKPROCESS_CHECKLINK_ZC2 == g_phy_current_param[pmgi_channel].mode)
    {
#if (ETHER_CFG_USE_LINKSTA == 1)
        reg = pmgi_read_reg(pmgi_channel);

        if (PHY_STATUS_LINK_UP != (reg & PHY_STATUS_LINK_UP))
        {    /* Link is down */
            pether_ch = g_eth_control_ch[channel].pether_control;
            phy_access = g_eth_control_ch[channel].phy_access;
            petherc_adr = pether_ch[phy_access].petherc;

            /* Disable receive and transmit. */
            petherc_adr->ECMR.BIT.RE = 0;
            petherc_adr->ECMR.BIT.TE = 0;

            transfer_enable_flag[channel] = ETHER_FLAG_OFF;

            if ((NULL != cb_func.pcb_func) && (FIT_NO_FUNC != cb_func.pcb_func))
            {
                cb_arg.channel = channel;
                cb_arg.event_id = ETHER_CB_EVENT_ID_LINK_OFF;
                (*cb_func.pcb_func)((void *) &cb_arg);
            }
        }
        else
        {
            R_BSP_NOP();
        }

        g_phy_current_param[pmgi_channel].mode = LINKPROCESS;
        g_phy_current_param[pmgi_channel].event = PMGI_COMPLETE;
        return ret;
#elif (ETHER_CFG_USE_LINKSTA == 0)
        g_phy_current_param[pmgi_channel].mode = LINKPROCESS;
        ret = ETHER_ERR_OTHER;
        return ret;
#endif
    }
    else if (WAKEONLAN_CHECKLINK_ZC == g_phy_current_param[pmgi_channel].mode)
    {
        reg = pmgi_read_reg(pmgi_channel);
        if (PHY_STATUS_LINK_UP != (reg & PHY_STATUS_LINK_UP))
        {
            g_phy_current_param[pmgi_channel].read_data = reg;
            g_phy_current_param[pmgi_channel].mode = WAKEONLAN;
            g_phy_current_param[pmgi_channel].event = PMGI_ERROR;
        }
        else
        {
            /* set the current parameter of phy */
            g_phy_current_param[pmgi_channel].read_data = reg;
            g_phy_current_param[pmgi_channel].mode = WAKEONLAN;
            g_phy_current_param[pmgi_channel].event = PMGI_COMPLETE;
        }
    }
    else
    {
        g_phy_current_param[pmgi_channel].mode = CHECKLINK_ZC;
        g_phy_current_param[pmgi_channel].event = PMGI_ERROR;
    }

    return ret;
} /* End of function pmgi_checklink_zc_step1() */

