nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/WolfSSLDemo/src/smc_gen/r_ether_rx/src/r_ether_rx.c
/******************************************************************************
* Function Name:    pmgi_linkprocess_step0
* Description  :    Processing after R_ETHER_LinkProcess'step0 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_linkprocess_step0(uint32_t channel)
{
    ether_return_t      ret = ETHER_SUCCESS;
    uint16_t            pmgi_channel;
    uint16_t            reg = 0;

    pmgi_channel = get_pmgi_channel(channel);

    /* set PMGI current parameter */
    g_phy_current_param[pmgi_channel].step = STEP1;
    g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

    pmgi_access(channel, PHY_REG_STATUS, reg, PMGI_READ);

    return ret;
} /* End of function pmgi_linkprocess_step0() */

/******************************************************************************
* Function Name:    pmgi_linkprocess_step1
* Description  :    Processing after R_ETHER_LinkProcess'step1 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_linkprocess_step1(uint32_t channel)
{
    ether_return_t      ret = ETHER_SUCCESS;
    uint16_t            pmgi_channel;
    uint16_t            reg;
    uint16_t            data = 0;

    g_local_pause_bits[channel] = 0;

    pmgi_channel = get_pmgi_channel(channel);

    reg = pmgi_read_reg(pmgi_channel);

    if (PHY_STATUS_LINK_UP != (reg & PHY_STATUS_LINK_UP))
    {
        R_BSP_NOP();
        ret = ETHER_ERR_OTHER;
        return ret;
    }
    else
    {
        /* Establish local pause capability */
        if (PHY_AN_ADVERTISEMENT_PAUSE == (local_advertise[channel] & PHY_AN_ADVERTISEMENT_PAUSE))
        {
            g_local_pause_bits[channel] |= (1 << 1);
        }

        if (PHY_AN_ADVERTISEMENT_ASM_DIR == (local_advertise[channel] & PHY_AN_ADVERTISEMENT_ASM_DIR))
        {
            g_local_pause_bits[channel] |= 1;
        }

        /* When the auto-negotiation isn't completed, return error */
        if (PHY_STATUS_AN_COMPLETE != (reg & PHY_STATUS_AN_COMPLETE))
        {
            /* When PHY auto-negotiation is not completed */
            transfer_enable_flag[channel] = ETHER_FLAG_OFF;
            lchng_flag[channel] = ETHER_FLAG_ON_LINK_ON;

            ret= ETHER_ERR_OTHER;
            return ret;
        }
        else
        {
            /* set the current parameter of phy */
            g_phy_current_param[pmgi_channel].step = STEP2;
            g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;
            pmgi_access(channel, PHY_REG_AN_LINK_PARTNER, data, PMGI_READ);
        }
    }
    return ret;
} /* End of function pmgi_linkprocess_step1() */

/******************************************************************************
* Function Name:    pmgi_linkprocess_step2
* Description  :    Processing after R_ETHER_LinkProcess'step2 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_linkprocess_step2(uint32_t channel)
{
    ether_return_t              ret = ETHER_SUCCESS;
    uint16_t                    link_speed_duplex = 0;
    uint16_t                    partner_pause_bits = 0;
    uint16_t                    transmit_pause_set = 0;
    uint16_t                    receive_pause_set = 0;
    uint16_t                    full_duplex = 0;
    uint16_t                    pmgi_channel;
    uint16_t                    reg;
    ether_cb_arg_t              cb_arg;

    volatile struct st_etherc R_BSP_EVENACCESS_SFR *    petherc_adr;
    volatile struct st_edmac R_BSP_EVENACCESS_SFR *     pedmac_adr;
    const ether_control_t *                             pether_ch;
    uint32_t                                            phy_access;

    pmgi_channel = get_pmgi_channel(channel);
    reg = pmgi_read_reg(pmgi_channel);

    pether_ch = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    petherc_adr = pether_ch[phy_access].petherc;
    pedmac_adr = pether_ch[phy_access].pedmac;

    /* Establish partner pause capability */
    if (PHY_AN_LINK_PARTNER_PAUSE == (reg & PHY_AN_LINK_PARTNER_PAUSE))
    {
        partner_pause_bits = (1 << 1);
    }

    if (PHY_AN_LINK_PARTNER_ASM_DIR == (reg & PHY_AN_LINK_PARTNER_ASM_DIR))
    {
        partner_pause_bits |= 1;
    }

#if ETHER_CFG_USE_PHY_ICS1894_32 == 0
    /* Establish the line speed and the duplex */
    if (PHY_AN_LINK_PARTNER_10H == (reg & PHY_AN_LINK_PARTNER_10H))
    {
        link_speed_duplex = PHY_LINK_10H;
    }
#endif /* ETHER_CFG_USE_PHY_ICS1894_32 == 0 */

    if (PHY_AN_LINK_PARTNER_10F == (reg & PHY_AN_LINK_PARTNER_10F))
    {
        link_speed_duplex = PHY_LINK_10F;
    }
#if ETHER_CFG_USE_PHY_ICS1894_32 == 0
    if (PHY_AN_LINK_PARTNER_100H == (reg & PHY_AN_LINK_PARTNER_100H))
    {
        link_speed_duplex = PHY_LINK_100H;
    }
#endif /* ETHER_CFG_USE_PHY_ICS1894_32 == 0 */

    if (PHY_AN_LINK_PARTNER_100F == (reg & PHY_AN_LINK_PARTNER_100F))
    {
        link_speed_duplex = PHY_LINK_100F;
    }

    switch (link_speed_duplex)
    {
        /* Half duplex link */
        case PHY_LINK_100H :
            petherc_adr->ECMR.BIT.DM = 0;
            petherc_adr->ECMR.BIT.RTM = 1;
            ret = ETHER_SUCCESS;
        break;

