nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/WolfSSLDemo/src/smc_gen/r_ether_rx/src/r_ether_rx.c
        case PHY_LINK_10H :
            petherc_adr->ECMR.BIT.DM = 0;
            petherc_adr->ECMR.BIT.RTM = 0;
            ret = ETHER_SUCCESS;
        break;

            /* Full duplex link */
        case PHY_LINK_100F :
            petherc_adr->ECMR.BIT.DM = 1;
            petherc_adr->ECMR.BIT.RTM = 1;
            full_duplex = 1;
            ret = ETHER_SUCCESS;
        break;

        case PHY_LINK_10F :
            petherc_adr->ECMR.BIT.DM = 1;
            petherc_adr->ECMR.BIT.RTM = 0;
            full_duplex = 1;
            ret = ETHER_SUCCESS;
        break;

        default :
            ret = ETHER_ERR_OTHER;
        break;
    }

    if (ETHER_SUCCESS == ret)
    {

        /* When pause frame is used */
        if ((full_duplex) && (ETHER_FLAG_ON == pause_frame_enable[channel]))
        {
            /* Set automatic PAUSE for 512 bit-time */
            petherc_adr->APR.LONG = 0x0000FFFF;

            /* Set unlimited retransmit of PAUSE frames */
            petherc_adr->TPAUSER.LONG = 0;

            /* PAUSE flow control FIFO settings. */
            pedmac_adr->FCFTR.LONG = 0x00000000;

            /* Control of a PAUSE frame whose TIME parameter value is 0 is enabled. */
            petherc_adr->ECMR.BIT.ZPF = 1;

            /**
             * Enable PAUSE for full duplex link depending on
             * the pause resolution results
             */
            ether_pause_resolution(g_local_pause_bits[channel], partner_pause_bits, &transmit_pause_set,
                    &receive_pause_set);

            if (XMIT_PAUSE_ON == transmit_pause_set)
            {
                /* Enable automatic PAUSE frame transmission */
                petherc_adr->ECMR.BIT.TXF = 1;
            }
            else
            {
                /* Disable automatic PAUSE frame transmission */
                petherc_adr->ECMR.BIT.TXF = 0;
            }

            if (RECV_PAUSE_ON == receive_pause_set)
            {
                /* Enable reception of PAUSE frames */
                petherc_adr->ECMR.BIT.RXF = 1;
            }
            else
            {
                /* Disable reception of PAUSE frames */
                petherc_adr->ECMR.BIT.RXF = 0;
            }
        }

        /* When pause frame is not used */
        else
        {
            /* Disable PAUSE for half duplex link */
            petherc_adr->ECMR.BIT.TXF = 0;
            petherc_adr->ECMR.BIT.RXF = 0;
        }

        /* Set the promiscuous mode bit */
        petherc_adr->ECMR.BIT.PRM = promiscuous_mode[channel];

        /* Enable receive and transmit. */
        petherc_adr->ECMR.BIT.RE = 1;
        petherc_adr->ECMR.BIT.TE = 1;

        /* Enable EDMAC receive */
        pedmac_adr->EDRRR.LONG = 0x1;

        if ((NULL != cb_func.pcb_func) && (FIT_NO_FUNC != cb_func.pcb_func))
        {
            cb_arg.channel = channel;
            cb_arg.event_id = ETHER_CB_EVENT_ID_LINK_ON;
            (*cb_func.pcb_func)((void *) &cb_arg);
        }

        g_phy_current_param[pmgi_channel].event = PMGI_COMPLETE;
    }
    else
    {
        /* When PHY auto-negotiation is not completed */
        transfer_enable_flag[channel] = ETHER_FLAG_OFF;
        lchng_flag[channel] = ETHER_FLAG_ON_LINK_ON;

        g_phy_current_param[pmgi_channel].event = PMGI_ERROR;
    }

    /* set the current parameter of phy */

    return ret;
} /* End of function pmgi_linkprocess_step2() */

/******************************************************************************
* Function Name:    pmgi_wakeonlan_step0
* Description  :    Processing after R_ETHER_WakeOnLAN'step0 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_wakeonlan_step0(uint32_t channel)
{
    ether_return_t      ret = ETHER_SUCCESS;
    uint16_t            pmgi_channel;
    uint16_t            reg = 0;

    pmgi_channel = get_pmgi_channel(channel);

    /* set the current parameter of phy */
    g_phy_current_param[pmgi_channel].step = STEP1;
    g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

    pmgi_access(channel, PHY_REG_STATUS, reg, PMGI_READ);

    return ret;
} /* End of function pmgi_wakeonlan_step0() */

/******************************************************************************
* Function Name:    pmgi_wakeonlan_step1
* Description  :    Processing after R_ETHER_WakeOnLAN'step1 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_wakeonlan_step1(uint32_t channel)
{
    ether_return_t      ret = ETHER_SUCCESS;
    uint16_t            pmgi_channel;
    uint16_t            reg;
    uint16_t            data = 0;

    g_local_pause_bits[channel] = 0;

    pmgi_channel = get_pmgi_channel(channel);

    reg = pmgi_read_reg(pmgi_channel);

    if (PHY_STATUS_LINK_UP != (reg & PHY_STATUS_LINK_UP))
    {
        R_BSP_NOP();
        ret = ETHER_ERR_OTHER;
    }
    else
    {
        /* Establish local pause capability */
        if (PHY_AN_ADVERTISEMENT_PAUSE == (local_advertise[channel] & PHY_AN_ADVERTISEMENT_PAUSE))
        {
            g_local_pause_bits[channel] |= (1 << 1);
        }

        if (PHY_AN_ADVERTISEMENT_ASM_DIR == (local_advertise[channel] & PHY_AN_ADVERTISEMENT_ASM_DIR))
        {
            g_local_pause_bits[channel] |= 1;
        }

        /* When the auto-negotiation isn't completed, return error */
        if (PHY_STATUS_AN_COMPLETE != (reg & PHY_STATUS_AN_COMPLETE))
        {
            ret= ETHER_ERR_OTHER;
        }
        else
        {
            /* set the current parameter of phy */
            g_phy_current_param[pmgi_channel].step = STEP2;
            g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;
            pmgi_access(channel, PHY_REG_AN_LINK_PARTNER, data, PMGI_READ);
        }
    }
    return ret;
} /* End of function pmgi_wakeonlan_step1() */

