nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/WolfSSLDemo/src/smc_gen/r_ether_rx/src/r_ether_rx.c
/******************************************************************************
* Function Name:    pmgi_wakeonlan_step2
* Description  :    Processing after R_ETHER_WakeOnLAN'step2 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI one step processing successful
*                   ETHER_ERR_OTHER
*                       Other error
******************************************************************************/
static ether_return_t pmgi_wakeonlan_step2(uint32_t channel)
{
    ether_return_t              ret = ETHER_SUCCESS;
    uint16_t                    link_speed_duplex = 0;
    uint16_t                    pmgi_channel;
    uint16_t                    reg;

    volatile struct st_etherc R_BSP_EVENACCESS_SFR *    petherc_adr;
    const ether_control_t *                             pether_ch;
    uint32_t                                            phy_access;

    pmgi_channel = get_pmgi_channel(channel);
    reg = pmgi_read_reg(pmgi_channel);

    pether_ch = g_eth_control_ch[channel].pether_control;
    phy_access = g_eth_control_ch[channel].phy_access;
    petherc_adr = pether_ch[phy_access].petherc;

    /* Establish the line speed and the duplex */
#if ETHER_CFG_USE_PHY_ICS1894_32 == 0
    if (PHY_AN_LINK_PARTNER_10H == (reg & PHY_AN_LINK_PARTNER_10H))
    {
        link_speed_duplex = PHY_LINK_10H;
    }
#endif /* ETHER_CFG_USE_PHY_ICS1894_32 == 0 */

    if (PHY_AN_LINK_PARTNER_10F == (reg & PHY_AN_LINK_PARTNER_10F))
    {
        link_speed_duplex = PHY_LINK_10F;
    }
#if ETHER_CFG_USE_PHY_ICS1894_32 == 0
    if (PHY_AN_LINK_PARTNER_100H == (reg & PHY_AN_LINK_PARTNER_100H))
    {
        link_speed_duplex = PHY_LINK_100H;
    }
#endif /* ETHER_CFG_USE_PHY_ICS1894_32 == 0 */

    if (PHY_AN_LINK_PARTNER_100F == (reg & PHY_AN_LINK_PARTNER_100F))
    {
        link_speed_duplex = PHY_LINK_100F;
    }

    switch (link_speed_duplex)
    {
        /* Half duplex link */
        case PHY_LINK_100H :
            petherc_adr->ECMR.BIT.DM = 0;
            petherc_adr->ECMR.BIT.RTM = 1;
            ret = ETHER_SUCCESS;
        break;

        case PHY_LINK_10H :
            petherc_adr->ECMR.BIT.DM = 0;
            petherc_adr->ECMR.BIT.RTM = 0;
            ret = ETHER_SUCCESS;
        break;

            /* Full duplex link */
        case PHY_LINK_100F :
            petherc_adr->ECMR.BIT.DM = 1;
            petherc_adr->ECMR.BIT.RTM = 1;
            ret = ETHER_SUCCESS;
        break;

        case PHY_LINK_10F :
            petherc_adr->ECMR.BIT.DM = 1;
            petherc_adr->ECMR.BIT.RTM = 0;
            ret = ETHER_SUCCESS;
        break;

        default :
            ret = ETHER_ERR_OTHER;
        break;
    }

    if (ETHER_SUCCESS == ret)
    {

        /* The magic packet detection is permitted. */
        petherc_adr->ECMR.BIT.MPDE = 1;

        /* Because data is not transmitted for the magic packet detection waiting,
         only the reception is permitted. */
        petherc_adr->ECMR.BIT.RE = 1;

        /*
         * The reception function of EDMAC keep invalidity
         * because the receive data don't need to be read when the magic packet detection mode.
         */
#if (ETHER_CFG_USE_LINKSTA == 1)
        pether_ch = g_eth_control_ch[channel].pether_control;
        phy_access = g_eth_control_ch[channel].phy_access;
        petherc_adr = pether_ch[phy_access].petherc;

        /* It is confirmed not to become Link down while changing the setting. */
        if (ETHER_CFG_LINK_PRESENT == petherc_adr->PSR.BIT.LMON)
        {
            ret = ETHER_SUCCESS;
            g_phy_current_param[pmgi_channel].event = PMGI_COMPLETE;
        }
        else
        {
            ret = ETHER_ERR_OTHER;
            g_phy_current_param[pmgi_channel].event = PMGI_ERROR;
        }
#elif (ETHER_CFG_USE_LINKSTA == 0)
        /* set the current parameter of phy */
        g_phy_current_param[pmgi_channel].mode = WAKEONLAN_CHECKLINK_ZC;
        g_phy_current_param[pmgi_channel].step = STEP0;
        g_phy_current_param[pmgi_channel].event = PMGI_RUNNING;

        pmgi_access(channel, PHY_REG_STATUS, reg, PMGI_READ);
#endif
    }
    else
    {
        g_phy_current_param[pmgi_channel].event = PMGI_ERROR;
    }

    return ret;
} /* End of function pmgi_wakeonlan_step2() */

/******************************************************************************
* Function Name:    pmgi_writephy_step0
* Description  :    Processing after R_ETHER_WritePHY'step0 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI operate successfully
******************************************************************************/
static ether_return_t pmgi_writephy_step0(uint32_t channel)
{
    ether_return_t      ret = ETHER_SUCCESS;
    uint16_t            pmgi_channel;

    /* set the current parameter of phy */
    pmgi_channel = get_pmgi_channel(channel);
    g_phy_current_param[pmgi_channel].event = PMGI_COMPLETE;

    return ret;
} /* End of function pmgi_writephy_step0() */

/******************************************************************************
* Function Name:    pmgi_readphy_step0
* Description  :    Processing after R_ETHER_ReadPHY'step0 is completed.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_SUCCESS
*                       PMGI operate successfully
******************************************************************************/
static ether_return_t pmgi_readphy_step0(uint32_t channel)
{
    ether_return_t      ret = ETHER_SUCCESS;
    uint16_t pmgi_channel;
    uint16_t reg_data;

    /* get the PMGI channel */
    pmgi_channel = get_pmgi_channel(channel);

    /* read the PMGI register */
    reg_data = pmgi_read_reg(pmgi_channel);

    /* set the current parameter of phy */
    g_phy_current_param[pmgi_channel].read_data = reg_data;
    g_phy_current_param[pmgi_channel].event = PMGI_COMPLETE;

    return ret;
} /* End of function pmgi_readphy_step0() */

/******************************************************************************
* Function Name:    pmgi_modestep_invalid
* Description  :    When the parameters of PMGI interrupt process function pointer array
*                   is error, return ETHER_ERR_INVALID_ARG.
* Arguments    :    channel -
*                       ETHERC channel number
* Return Value :    ETHER_ERR_INVALID_ARG
*                       The paramters of PMGI interrupt processing function pointer array
*                       is error.
******************************************************************************/
static ether_return_t pmgi_modestep_invalid(uint32_t channel)
{
    return ETHER_ERR_INVALID_ARG;
} /* End of function pmgi_modestep_invalid() */
#endif /* (ETHER_CFG_NON_BLOCKING == 1) */

